// Константы для отрисовки этажей в трехмерном пространстве
/**
 * Высота этажа
 */
export const floor_height = 3
/**
 * Высота аудиторий
 */
export const room_height = 2.8
/**
 * Толщина стен этажа
 */
export const floor_walls = 0.5
/**
 * Толщина стен аудиторий
 */
export const room_walls = 0.2
/**
 * Отступ между этажами для разделения
 */
export const floor_gap = 0.05
/**
 * Множитель для координат для масштабирования (может и не пригодится, потому 1)
 */
export const scale = 0.1
/**
 * Смещение корпусов относительно начала координат (delta_x, delta_y, rotation, scale)
 */
export const buildingOffsets = {
    'bc1c5554-bcc6-499f-884d-25b8b5e42ad8': // 3бв - начало координат
        [0, 0, 0, 1],
    '8daaefe1-444b-4635-a639-550f760504c3': // 3а
        [100, 0, 0, 1],
    '05ce1485-31b1-4ba1-9eb7-532bc8e0f7d9': // 2
        [200, 0, 0, 1],
    '19b87fc6-cf01-4909-9e5b-9caa419528be': // 3г
        [300, 0, 0, 1],
    '50fdc831-38d7-4e74-8c2d-bd194b26476a': // 3д
        [400, 0, 0, 1],
    '9c7a0f84-03b0-40b0-8fb0-992e1008c11e': // восточное
        [0, 250, 0, 1],
    'e9e0d43e-f419-4f97-99d4-694c06d738d8': // центр
        [150, 250, 0, 1],
    'bce65150-c95a-40cb-a59e-9774f5e1b249': // западное
        [350, 250, 0, 1],
    'a9781b13-37ac-4dfd-a691-a402309dd15a': // 1а
        [300, 180, 0, 1],
    '625d7e06-0632-49ce-9b5b-cb7755adfa2c': // 1б
        [400, 180, 0, 1],
    'a6010bc2-5157-4c33-8cac-bce9bb01bc1c': // 4
        [0, 400, 0, 1],
    '176fcafb-6d1d-4043-926e-302b1fec4c45': // 5а
        [100, 400, 0, 1],
    '0db33e18-c2a0-43aa-a0f4-83ecd5ce7f81': // 5б
        [200, 400, 0, 1],
    '81ab6a1b-5c43-499e-b06e-9289745f2aaf': // Сигма
        [300, 400, 0, 1],
}
